---
kind: property
id: P:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.ServiceId
source: html/7b6bb800-5d56-2582-11eb-7b5df769d7a7.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap.ServiceId Property

The service identifier of the straight.

## Syntax (C#)
```csharp
public int ServiceId { get; set; }
```